package day01;

public class Ex01 {
/*
 	1. 5, 10, 20 을 제외한 숫자 하나를 가정하고(양수, 음수 모두)
 		이것을 2진수로 바꿔보고
 		실제 프로그램의 결과와 일치하는지 확인하세요.
 		
 		비트코드 확인 방법
 			Integer.toBinaryString(숫자)
 			
 -------------------------------------------------------------------------
 	2. 반지름이 7인 원의 넓이, 둘레를 계산해서 출력하세요.
 		원의 둘레 : 2 * 반지름 * 3.14
 		원의 넓이 : 반지름 * 반지름 * 3.14
 		
 		단, 반지름, 둘레, 넓이는 변수를 만들어서 처리를 하세요.
 		그리고 둘레는 float 타입의 변수로 만드세요.
 		
 	3. 두개의 숫자(정수)를 변수에 담고
 	 	두 수를 가로, 세로로 하는 사각형의 넓이를 구하세요.
 	 	
 	4. 3번 문제의 두 수를 밑변과 높이로 가지는 삼각형의 넓이를 구하세요.
 	
 	5. 54232원을 지불해야한다.
 		우리나라의 화폐로 각 단위가 몇개나 필요한지 계산해서 출력하세요.
 		5만원권 - 1장
 		1만원권 - 0장
 		5천원권 - 0장
 		1천원권 - 4장
 		
 숙제]
 	1년은 365.2426일이다.
 	이 날짜는 과연 몇일 몇시간, 몇분, 몇초인지 계산해서 출력하세요.
 */
	public static void main(String[] args) {
		
		//15 --> 1111 
		
		System.out.println(Integer.toBinaryString(15));
	}
}
